#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
tls_private_key.main: Refreshing state... [id=52c5e3bb480a66b7c32fe4ca373c60874d701700]
data.azurerm_resource_group.example: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05MGQ4NDdhYS01ZjUxLTRmZGEtYWRmMy04NjdlNzRiNGFhZDE7b2JqZWN0SWQ9M2E2ZGE1NjgtOGI2NS00OWVkLThmNzItMmM2OGNmZDY0NmFiO3N1YnNjcmlwdGlvbklkPWE1MmUyZDlmLWRlZGEtNDhkMy1iNGYyLTAwYzNlNjkyZGQ0Njt0ZW5hbnRJZD1jNTAwZDhhZi03MTVmLTQ3YTgtODI2ZS0wN2JlNDU4ODM2YmM=]
data.azurerm_resource_group.example: Read complete after 0s [id=/subscriptions/a52e2d9f-deda-48d3-b4f2-00c3e692dd46/resourceGroups/JP-150623-dev]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/a52e2d9f-deda-48d3-b4f2-00c3e692dd46/resourceGroups/JP-150623-dev/providers/Microsoft.Network/virtualNetworks/example-network]
azurerm_subnet.example: Refreshing state... [id=/subscriptions/a52e2d9f-deda-48d3-b4f2-00c3e692dd46/resourceGroups/JP-150623-dev/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal]
azurerm_network_interface.example: Refreshing state... [id=/subscriptions/a52e2d9f-deda-48d3-b4f2-00c3e692dd46/resourceGroups/JP-150623-dev/providers/Microsoft.Network/networkInterfaces/example-nic]
azurerm_linux_virtual_machine.example: Refreshing state... [id=/subscriptions/a52e2d9f-deda-48d3-b4f2-00c3e692dd46/resourceGroups/JP-150623-dev/providers/Microsoft.Compute/virtualMachines/example-machine]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.example must be replaced
-/+ resource "azurerm_linux_virtual_machine" "example" {
      ~ computer_name                   = "example-machine" -> (known after apply)
      - encryption_at_host_enabled      = false -> null
      ~ id                              = "/subscriptions/a52e2d9f-deda-48d3-b4f2-00c3e692dd46/resourceGroups/JP-150623-dev/providers/Microsoft.Compute/virtualMachines/example-machine" -> (known after apply)
      ~ name                            = "example-machine" -> "example-machine-pr" # forces replacement
      ~ private_ip_address              = "10.0.2.4" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.0.2.4",
        ] -> (known after apply)
      + public_ip_address               = (known after apply)
      ~ public_ip_addresses             = [] -> (known after apply)
      - secure_boot_enabled             = false -> null
      - tags                            = {} -> null
      ~ virtual_machine_id              = "1d4eb5db-5501-4c2d-a813-b0880430b33a" -> (known after apply)
      - vtpm_enabled                    = false -> null
        # (14 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
          ~ name                      = "example-machine_OsDisk_1_b6975e7674264a888a0da6043e9948ba" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @JamesPearceNHS, Action: `pull_request`*